In [15]:
import pandas as pd

## Series() - homogeneous elements of any datatype

In [3]:
#Creation of Empty Series
d=pd.Series(dtype='int32') #any datatype 
d

Series([], dtype: int32)

In [7]:
#Creating series with 1 element
d=pd.Series(643.50)   
d    #prints index and value and data type

0    643.5
dtype: float64

In [10]:
#Use tuple to make series
t=(1,4,6)
d=pd.Series(t)
d

0    1
1    4
2    6
dtype: int64

In [12]:
#Using list
L=[1,4,6]
d=pd.Series(L)
d

0    1
1    4
2    6
dtype: int64

In [22]:
#Using array
f=pd.array([4,5,7,1,2,6,8,9])
y=pd.Series(f)
y

#OR

'''
import numpy as np
arr_1=np.array([2,3,4])
s_3=pd.Series(arr_1)
s_3
'''

#OR
"""
d=pd.Series([1,2,3],[4,5,6])
d
"""

'\nd=pd.Series([1,2,3],[4,5,6])\nd\n'

In [32]:
#change default index values
a=np.array([1,2,3])
b1=pd.Series(a,index=['one','two','three'])
b1

one      1
two      2
three    3
dtype: int32

In [27]:
#pass 2 lists assuming 1st is index 2nd is value

In [28]:
#usee dict to make series
d={1:'a',2:'b'}
b=pd.Series(d)
b

1    a
2    b
dtype: object

In [29]:
#to check datatype
type(b)
#library.class.method.function

pandas.core.series.Series

In [33]:
#access data
b1['one']

1

In [42]:
s1=pd.Series([71,2,5,6,8,1,3,56,153,645,8])
#s1[[4,5,2,9]]  #to get multiple indexes
#s1[0:]  #till end
#s1[0:-1]  #till end
#s1[2:6]  #range
s1[2:9:2]   #stepwise range

2      5
4      8
6      3
8    153
dtype: int64

## Dataframes

In [45]:
d=pd.DataFrame()
print(d)

Empty DataFrame
Columns: []
Index: []

In [49]:
data=[[1,2,46,2,327,00],[124,5236,8652,418,2,6,9]]
d=pd.DataFrame(data)
d   #2 lists = 2 rows....7 elements=7 col
#NaN means no value and that corresponding col next row value becomes float

     0     1     2    3    4  5   6
0    1     2    46    2  327  0  90
1  124  5236  8652  418    2  6   9

In [54]:
da=[['a',1],['b',1],['c',3],['d',2]]
#a=pd.DataFrame(da)
#a
b=pd.DataFrame(da,columns=['A','B'])
b

   A  B
0  a  1
1  b  1
2  c  3
3  d  2

In [55]:
#using dict create dataframe
m={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}
m1=pd.DataFrame(m)
m1

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [62]:
n=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],['Boris',14,'Geo'],['Ken',18,'English']]
n1=pd.DataFrame(n,columns=['Name','Age','Sub'])
n1   #prints full table
n1['Name']   #prints Name of the table
#in pandas, string datatypes become object

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [63]:
#to access single element using index - iloc (index location)
n1.iloc[0,2]   #row,col
n1.iloc[4,2]

'English'

In [74]:
#n1.iloc[0,2]
#n1.iloc[:,[0]]
n1.loc[:,['Name']]   #loc will work for rows and name of col
n1.loc[0:2]  #get rows
n1.loc[2]

Name    Kelly
Age        15
Sub       Eco
Name: 2, dtype: object

In [75]:
n1.iloc[:,1]

0    10
1    12
2    15
3    14
4    18
Name: Age, dtype: int64